/*
 * @Author: Willie Chen
 * @LastEditors: Willie Chen
 * @Date: 2020-06-05 10:05:50
 * @LastEditTime: 2021-05-12 17:42:52
 * @Description: 游戏数据
 */

module.exports = {
  seascapes: {
    name: '海岛新时代',
    desc: [
      '《海岛新时代》是一款全新设计的解谜消消乐游戏！你将到传说中众神和英雄们统治的希腊游玩，帮助波塞冬的儿子-特里托，从海妖的阴谋中拯救他的家庭和他的王国。',
      '邪恶的女巫魅惑了海神，破坏了他的三叉戟并将碎片藏在了汪洋大海之中！只有特里托，能够通过移动并组合三种或以上的碎片所产生的魔力，将和平与和谐带回到海洋深处。',
      '与特里托和他的好友-章鱼小八，一起沉浸在这片活力四射海洋世界中吧！向奇特的海洋生物伸出你的援手，重建华丽的海中花园，让昔日传说中的海底城市重返繁荣！巨鲸，睿龟，神出鬼没的海马都在特利托精彩的冒险中等着你！'
    ],
    features: [
      '极吸引人的剧情和有挑战性的消消乐谜题',
      '不同的星球上众多的海底城市正等着你去探索',
      '过目不忘，充满幽默的海底生物',
      '数百个既独特又有挑战性的消消乐谜题',
      '精彩绝伦的炸弹爆炸动画'
    ],
    icon: '/images/games/game2.png',
    banner: '/images/games/game2-banner.jpg',
    screenshots: [
      '/images/games/game2-showpic1.jpg',
      '/images/games/game2-showpic2.jpg',
      '/images/games/game2-showpic3.jpg'
    ]
  },
  idleCook: {
    name: 'Idle Cook',
    desc: [
      '《Idle Cook》是由Carry Studio工作室研发的一款放置经营类美食游戏。在这里，你将经营自己的美食帝国！你是否梦想拥有自己的美食餐厅？成为改变命运的那个人？打造自己的商业帝国，让你的美食享誉全世界？《Idle Cook》正是为你量身打造的美食休闲游戏！',
      '从点击食谱并卖出第一份美食开始，你将停不下来！不断点击，雇佣魔法厨师，一步一步扩大规模，创造全世界的商业帝国！现在你已经掌握诀窍了吧！',
      '探索新的食谱、购买新的分店、抢占市场并吸引天使投资者的注意以提高你的利润！你要做的就是前进、前进再前进！为梦想，拼了！'
    ],
    features: [
      '自动化管理，离线就把钱收了',
      '精明投资连锁店，打造自己的商业帝国',
      '魔法厨师来相助，策略组合最大化美食收益',
      '外卖小哥有技能，轻轻松松把钱赚',
      '食谱合成，上百种食谱有你探索，由你创造',
      '独特时装系统，摇身一变大富豪'
    ],
    icon: '/images/games/game1.png',
    banner: '/images/games/game1-banner.jpg',
    media: {
      video: 'http://dodo.jodocdn.com/game-cook.mp4',
      poster: '/images/games/game1-banner.jpg',
      title: '量身打造的美食休闲游戏... ',
    },
    screenshots: [
      '/images/games/game1-showpic1.jpg',
      '/images/games/game1-showpic2.jpg',
      '/images/games/game1-showpic3.jpg'
    ]
  },
  rhinoCatstower: {
    name: '梦幻契约-猫咪进化论',
    desc: [
      '喵~喵~请注意，猫主子还有10秒到达现场，快来一起收集可爱的猫咪吧！放置、合成、云撸猫，就是这么简单！这是一款先给所有猫奴和放置合成手游爱好者的诚意之作。这里有数百种各色猫咪等你来认领，通过合成，升级，就可以领养到超稀有，超可爱的猫咪。领养之后要记得好好照顾猫主子哦，在猫咪公寓里，可以通过日常任务获得钻石奖励，然后就可以购买各种道具逗猫主子开心，快来给它们起个独特的名字，陪它们一起玩耍一起成长吧！'
    ],
    features: [
      '零门槛养猫，放置养成与合成要素相结合，玩法简单易上手',
      '猫咪收集，上百种性格各异的猫咪等你来收集，持续更新，吸猫管够',
      '花式养猫，各式各样的玩具，家具任你挑选，供您逗猫主子开心',
      '治愈系猫咪殿堂，俏皮的眨眼，可爱到酥的小奶音，活灵活现的动作表现，猫咪就是小天使',
      '猫的报恩，创新挂机元素与云养猫玩法相结合，伺候好了，猫主子自会有金币打赏'
    ],
    icon: '/images/games/game4.png',
    banner: '/images/games/game4-banner.jpg',
    screenshots: [
      '/images/games/game4-showpic1.jpg',
      '/images/games/game4-showpic2.jpg',
      '/images/games/game4-showpic3.jpg',
      '/images/games/game4-showpic4.jpg',
      '/images/games/game4-showpic5.jpg'
    ]
  },
  bulletmaster: {
    name: '全民出击-子弹大师',
    desc: [
      '谍影重重包围之下，身为孤胆特工，你准备好了吗？是成为传说，还是成为无名英雄？面对谜题，瞄准敌人，用子弹告诉他们答案！',
      '面对狡猾的敌人，你可以一击制胜吗？没有强力后援，弹药数量有限，你是否可以充分利用你的智慧，揭开谜题，化解危机？突破极限才能突出重围，活下来，就是传奇！你，准备好了吗！'
    ],
    points: [
      {
        title: '铲奸除恶，拯救世界',
        desc: [
          '总有一些脑洞大开的邪恶势力想要统治世界，而你，就是邪恶计划的粉碎者。地下团伙、外星人、超进化生物，无论对手是谁，在他们得手之前找到他们，用子弹扫尽邪恶，维护世界和平！'
        ]
      },
      {
        title: '活用机关，轻松制敌',
        desc: [
          '让子弹飞，物理弹射，触发机关，引爆炸药，粉碎敌人！仔细观察地图，利用机关，轻松消灭敌人，让敌人在无知中灰飞烟灭。'
        ]
      },
      {
        title: '挑战三星，王牌特工',
        desc: [
          '如何毫不费力地解决敌人可是个技术活，开动你的大脑，挑战关卡三星评价，争做王牌特工。'
        ]
      },
      {
        title: '收集解锁，炫彩皮肤',
        desc: [
          '人靠衣装，马靠鞍装。身为王牌特工，这里早已准备好了数十种皮肤。接受任务，使命必达，领取金币奖励，解锁炫彩时装，天天不重样。'
        ]
      },
      {
        title: '全新挑战，持续更新',
        desc: [
          '无限挑战模式挑战无限关卡，救赎模式消灭敌人解救人质，快速射击模式调整枪法极限，手雷对决挑战技巧全能。'
        ]
      }
    ],
    icon: '/images/games/game3.png',
    banner: '',
    screenshots: [
      '/images/games/game3-showpic1.jpg',
      '/images/games/game3-showpic2.jpg',
      '/images/games/game3-showpic3.jpg',
      '/images/games/game3-showpic4.jpg'
    ]
  },
  mrSpy: {
    name: 'Mr. Spy',
    desc: [
      '拿起你的武器，拯救世界吧！Mr.Spy!',
      '你准备像真正的射手一样成为英雄吗？你是否对间谍与邪恶的斗争充满好奇？作为一个间谍，独自一人清除周围的所有邪恶。生存还是毁灭？作为一名射手，是时候开始这个射击嘉年华了！作为一个真正的粉丝，你怎么能错过这样出色的射击游戏！不要犹豫，选择你最喜欢的超级英雄，并选择一个强大的武器来开始这个冒险吧！'
    ],
    points: [
      {
        title: '瞄准和战斗邪恶',
        desc: [
          '在这场射击游戏和间谍游戏中尽力生存，即使可能性微小也要与命运作斗争！'
        ]
      },
      {
        title: '解锁传奇武器',
        desc: [
          '解锁强大的武器！完成任务，获得奖励，然后，你就可以拥有梦想武器！'
        ]
      },
      {
        title: '超级大国超级英雄',
        desc: [
          '超级英雄可以帮助您完成任务。 召唤具有各种超级能力的超级英雄可完成任务！'
        ]
      }
    ],
    icon: '/images/games/game5.png',
    banner: '',
    screenshots: [
      '/images/games/game5-showpic1.jpg',
      '/images/games/game5-showpic2.jpg',
      '/images/games/game5-showpic3.jpg',
      '/images/games/game5-showpic4.jpg',
      '/images/games/game5-showpic5.jpg'
    ]
  },
  xiaoyao: {
    name: '一念逍遥',
    desc: [
      '游戏围绕“修仙”设计了许多内容，并通过挂机的玩法，让你轻松实现修仙梦。',
      `开局先选修炼方向，崇尚极致武道选炼体，追求天地五行则选修法。确定修炼方向后，就算正式踏上长生路了。
      <br>自此，你跟着师父一起，习神通集古宝，御灵兽种灵植。去各大秘境历练，挑战上古妖兽，切磋同门兄弟。仙丹灵器自己炼，一日筑基成功，三日突破元婴！<br>待到合适之时，便可下山闯荡。
      <br>或做个自由散人，巧遇福地机缘，逍遥天下；或自立山头，与好友开宗立派，称霸天下。`,
      '除了以上内容外，《一念逍遥》还有三大“特色”。'
    ],
    points: [
      {
        title: '一、水墨国风，尽显仙风道骨',
        desc: [
          '《一念逍遥》基于中国传统的写意水墨流派，参考封神榜以及山海经等中国古代神话，构建出一个水墨丹青的仙侠世界，让你感受仙道文化的飘逸洒脱。'
        ]
      },
      {
        title: '二、拟真放置，挂机≠数值堆砌',
        desc: [
          '与传统放置类游戏不同。',
          '《一念逍遥》独创真实挂机玩法，即使你离线，服务器也会模拟真实在线产出对应收益。同时可以和其他在线玩家产生实时交互。'
        ]
      },
      {
        title: '三、千人同图，仙路漫漫吾道不孤',
        desc: [
          '《一念逍遥》采用自研动态编程语言进行服务器开发，支持千人同屏的宗门战、组队屠魔、异界入侵等社交玩法，摆脱“挂机=单机”的局面。'
        ]
      }
    ],
    icon: '/images/service/game/icon-xiaoyao.png',
    screenshots: [
      '/images/games/game-xiaoyao-showpic-1.jpg',
      '/images/games/game-xiaoyao-showpic-2.jpg',
      '/images/games/game-xiaoyao-showpic-3.jpg',
      '/images/games/game-xiaoyao-showpic-4.jpg'
    ],
  },
  woniu: {
    name: '最强蜗牛',
    desc: [
      '这是一款拥有放置元素的收集养成游戏，也是披着游戏外衣的大型情景喜剧，玩家将扮演一只弱小的蜗牛，通过自身努力最终超越包括人类在内的所有种族，成为最强生物的故事。',
      '友情提示：本作剧情内容极度沙雕，食用前请勿擅自喝水。'
    ],
    points: [
      {
        title: 'For：喜欢剧情的玩家',
        desc: `
          1、严格来说，《最强蜗牛》不仅是一款游戏，还是一个能玩的故事。游戏里任何一个功能，无论是常见功能还是特殊功能，都会讲一个故事，对整个系统和世界观非常融入，每一个细节都是整个故事的完整呈现。|
          2、主线剧情+黑魂式碎片化叙事风格|
          3、乌托邦式剧情，分为表世界和里世界|
          4、表世界观：精心制作的过场动画片，轻松了解基本的剧情|
          5、里世界观：剧情、世界观线索化，我们把这个世界的一切埋藏在各个角落，哪怕是一个微不足道的道具，都有一段神奇的故事，不看，你也能了解到基本的剧情，但是仔细钻研，会发现高能。
        `.split('|').map(p => p.trim()),
      },
      {
        title: 'For：休闲玩家',
        desc: `
        1、本质上是一款放置类游戏，副本通关、资源产出大部分都靠挂机|
        2、上手简单，单手即可完成所有操作，另外一只手可以干点别的|
        3、严肃认真地讲段子，老学究与沙雕网友的激情碰撞|
        4、游戏中知识点很多，可以顺便学习（学渣可忽略）|
        5、400多种贵重品图鉴，绝对满足收集癖|
        6、经营动态小窝：不断生产的食物，培育蝌蚪，可以进化的贩售机，一只越长越丑的猫，偶尔会有一些飞鸟、一些奇奇怪怪的人带着礼物来做客，可千万不要冷落他们
        `.split('|').map(p => p.trim()),
      },
      {
        title: 'For：硬核玩家',
        desc: `
        副本：超高脑洞副本设计，手游玩法百科全书，全程高能不断|
        1、八个国家地区，每个国家都有不同的玩法——扶桑忍术、华夏的武将卡牌，米国的英雄搭配，英伦海战，埃罗塔防，希域换装……|
        2、每个国家都有现在、过去和未来三种不同内容的副本，绝对意想不到|
        3、每个国家都会有相应的神域，魔神就在那里，打败他们。|
        4、副本内成长：每个副本都拥有独有的成长体系|
        5、随机事件，未知的下一秒可能是惊喜，也可能是惊吓|
        6、与使徒战斗，邂逅会为你生孩子的伙伴|
        7、不同副本不同力量体系|
        <br>|
        养成|
        1、现实主义五维：文化、艺术、信仰、科技、人气。文化成就命运，艺术决定格局，信仰代表意志，科技改变未来，人气拥有……热搜。|
        2、进化：肌体进化、捕食系统进化、脑域进化、神经元进化、视觉进化。每一个细节进化，除了能改变各项能力值，还能改变外观，你可以通过不同的侧重点成为一只漂亮的蜗牛，也能雨露均沾成为光头强者|
        3、变异：天使、恶魔、丧尸……不同的变异形态拥有不同的能力|
        4、贵重品收集：400多贵重品，每一个都是独有的属性
        `.split('|').map(p => p.trim()),
      },
      {
        title: 'For：不思议迷宫老玩家',
        desc: `
        1、隐藏要素非常多：隐藏的武器库、被封印的火箭、爬满蜘蛛的地下室|
        2、拥有非常完善的收集要素、养成要素|
        3、彩蛋依旧是游戏的本体|
        4、游戏里有一台个人电脑：小游戏99合一，2048、城市消消乐、俄罗斯方块……，他们隐藏在世界各地中，找到他们并安装在你的电脑中，便可以随时玩耍|
        <br>|
        <br>|
        -IOS游戏免费榜第一；畅销榜第二|
        -2020全年流水超1亿|
        -国内5年以上长线发展重点项目|
        -今年启动最强蜗牛海外联合发行
        `.split('|').map(p => p.trim()),
      }
    ],
    pointTitle: '特色玩法',
    icon: '/images/service/game/icon-woniu.png',
    screenshots: [
      '/images/games/game-woniu-showpic-1.jpg',
      '/images/games/game-woniu-showpic-2.jpg',
      '/images/games/game-woniu-showpic-3.jpg',
      '/images/games/game-woniu-showpic-4.jpg'
    ],
  },
}